// 在范围内，向左移一位结果是原数向下取整*2，向右移一位结果是原数向下取整/2再向下取整
// 在范围内，
//     向左移一位结果：原数向下取整*2
//     向右移一位结果：原数向下取整/2，再向下取整。（注意负数的向下取整，例如-2.5向下取整为-3）
// 超出范围要用补码具体计算

console.log("4 << 1", 4 << 1); // 8
console.log("4 >> 1", 4 >> 1); // 2
console.log("-4 << 1", -4 << 1); //-8
console.log("-4 >> 1", -4 >> 1); // -2
console.log("2^31-1 << 1", (Math.pow(2, 31) - 1) << 1); // -2
console.log("-2^31 << 1", -Math.pow(2, 31) << 1); // 0

console.log("4.5 << 1", 4.5 << 1); // 8
console.log("-4.5 << 1", -4.5 << 1); // -8

console.log("5 >> 1", 5 >> 1); // 2
console.log("-5 >> 1", -5 >> 1); // -3

console.log("5.5 >> 1", 5.5 >> 1); // 2
console.log("-5.5 >> 1", -5.5 >> 1); // -3
