///////////////////////////////////////////////
//Object.assign实行的是浅拷贝
console.log(Object.assign(
    {a: {b: 10, c: 100}},
    {a: {d: 1000}})
);

//////////////////////////////////////////
// 同名属性会被替换
console.log(Object.assign({a: 12}, {a: 34}));

/////////////////////////////////////////////////////////
// 可以处理数组

//////////////////////////////////////////////////////////
// 不能被正确处理取值函数和赋值函数，将直接返回属性描述对象的value，即取值函数返回的值
let obj = Object.assign(
    {},
    {
        get a() {return 10},
        set a(value) {
            console.log('set a:', value);
            this._a = value;
        }
    }
);
obj.a = 100;
console.log(obj);



